jutoroa/STM32F411RE/roboticArm_V2/Src/roboticArmV2.c
/*
 * I2CMPU6050.c
 *
 *  Created on: 4/05/2022
 *  Author: Juan Pablo
 *
 * // *************** // Proyecto: Brazo robótico // *************** //
 */


// *************** // INCLUDES // *************** //

#include <stm32f4xx.h>
#include <stdlib.h>
#include <string.h>
#include <stdio.h>
#include <stdint.h>
#include <stdbool.h>
#include <math.h>

#include "GPIOxDriver.h"
#include "USARTxDriver.h"
#include "TIMxDriver.h"
#include "AdcDriver.h"
#include "EXTIxDriver.h"
#include "I2CxDriver.h"
#include "SysTickDriver.h"
#include "PWMxDriver.h"
#include "MPU6050Driver.h"
#include "rtcDS1307Driver.h"
#include "OLEDDriver.h"
#include "FPUDriver.h"

// *************** // VARIABLES PROYECTO // *************** //

GPIO_Handler_t handlerStateLED 		= {0};	// StateLED
TIMER_Handler_t handlerTimer2 		= {0};	// Timer2
TIMER_Handler_t handlerTimer3 		= {0};	// Timer3
TIMER_Handler_t handlerTimer4 		= {0};	// Timer4

GPIO_Handler_t 	handlerUSBRX 		= {0};	// Pin USB PA2 RX
GPIO_Handler_t 	handlerUSBTX 		= {0};	// Pin USB PA3 RX
USART_Handler_t handlerCommTerminal = {0};	// Usart2

/* Configuración para los motores paso a paso */

GPIO_Handler_t handlerStep1Config 	= {0};		// Motor Base
GPIO_Handler_t handlerDir1Config 	= {0};
GPIO_Handler_t handlerStep2Config 	= {0};		// Motor articulación hombro x2
GPIO_Handler_t handlerDir2Config 	= {0};
GPIO_Handler_t handlerStep3Config 	= {0};		// Motor articulación codo x1
GPIO_Handler_t handlerDir3Config 	= {0};

// Variable auxiliar para evaluar los casos de cada motor

uint32_t 	nMotor 			= 0;
uint8_t 	dataValue 	 	= '\0';
uint32_t 	pasos 			= 5;						//Variable que define la cantidad de pasos
uint32_t 	delayTime 		= 50;						//Tiempo de delay entre paso y paso del motor en ms
uint32_t 	auxLedState 	= 0;


/* Configuración para los servomotores */
GPIO_Handler_t	handlerPinServo1		= {0};	// Pin para el servo1
GPIO_Handler_t	handlerPinServo2		= {0};	// Pin para el servo1
GPIO_Handler_t	handlerPinServo3		= {0};	// Pin para el servo1
PWM_Handler_t	handlerPWMServo1		= {0};	// PWM para los servos
PWM_Handler_t	handlerPWMServo2		= {0};	// PWM para los servos
PWM_Handler_t	handlerPWMServo3		= {0};	// PWM para los servos

ADC_Config_t 	handlerADC				= {0};	// ADC

uint8_t 	PWMBuffer 			= 0;
uint16_t	initialDuty			= 200;

/* Configuración para el I2C */
GPIO_Handler_t handlerI2CSDA_MPU6050 			= {0};	// SDA para el I2C	MPU6050
GPIO_Handler_t handlerI2CSCL_MPU6050			= {0};	// SCL para el I2C	MPU6050
I2C_Handler_t  handler_MPU6050	 				= {0};	// I2C (1) para el RTC	MPU6050

GPIO_Handler_t handlerI2CSDA_OLED 				= {0};	// SDA para el I2C	OLED 1.3"
GPIO_Handler_t handlerI2CSCL_OLED 				= {0};	// SCL para el I2C	OLED 1.3"
I2C_Handler_t  handler_OLED	 					= {0};	// I2C (3) para el  OLED 1.3"

/* Variables para la configuración del MPU6050 */
#define numberofsensor 	3								// Cantidad de sensores
char		MPUBufferAccel[256];						// Buffer para almacenar los datos
char		MPUBufferGyro[256];							// Buffer para almacenar los datos
uint8_t		MPU6050IsReady					= false;	// Bandera para controlar la lectura de datos
uint16_t	counterMPU6050					= 0;		// COUNTER MPU6050

uint32_t counterMillis				= 0;				// Contador para medir el tiempo
uint32_t timePrev					= 0;				// Variable que almacenará el tiempo inmediatamente anterior
uint32_t dt							= 0;				// Variable para medir el diferencial de tiempo
double girosc_ang_x, girosc_ang_y;						// Variables para calcular los angulos a través del giroscopio
double girosc_ang_x_prev = 0, girosc_ang_y_prev = 0;

double ang_x,ang_y;										// Variables para calcular los angulos a través del filtro complementario
double ang_x_prev, ang_y_prev;
double duty_x, duty_y;

/* Variables para la conversión ADC */

uint8_t		adcIsComplete   = false;			// Variable que nos permite saber el estado de si se completó la conversión ADC
uint16_t 	adcData			= 0;				// Valor obtenido por el ADC

/* Variables auxiliares */

/* Configuración para la OLED */
char 		bufferDataOLED[128] = {0};

uint8_t 	i2cBuffer 				= 0;				// Buffer para el I2C
uint16_t counterStateLED			= 0;
int  counterDelay 					= 0;
char bufferData[256] 				= "¡Hola! Soy el USART del STM32 y estoy funcionando.";		// Mensaje de Bienvenida

// *************** // Headers // *************** //

void delay(int time);
void initSystem(void);
void motorConfig(void);
void ledControl(void);

// *************** // MAIN // *************** //
int main(void)
{

	// Inicializamos la FPU
	FPUInit();
	// Inicializamos el sistema
	initSystem();
	writeMsg(&handlerCommTerminal,bufferData);

	// Función para inicializar el MPU6050
	MPU6050_writeByte(&handler_MPU6050, MPU6050_RA_PWR_MGMT_1, 0x00);
	// Escribimos un mensaje de confirmación por consola
	i2cBuffer = MPU6050_readByte(&handler_MPU6050, MPU6050_RA_PWR_MGMT_1);
	sprintf(bufferData, "Registro PWR MGMT = 0x%2x \n", (unsigned int) i2cBuffer);
	writeMsg(&handlerCommTerminal, bufferData);
	writeMsg(&handlerCommTerminal, "MPU6050 ha sido inicializado correctamente. \n");

	// Cargamos la configuración Inicial en la OLED
	OLED_Init(&handler_OLED);
	OLED_Clean(&handler_OLED);
	sprintf(bufferDataOLED, "<<<<<<<<<<<<<<<<  HOLA!          SOY EL STM32   <<<<<<<<<<<<<<<<");
	OLED_FPrint(&handler_OLED, bufferDataOLED);

	timePrev = counterMillis;					// Actualizamos el to

    /* Ciclo principal */
	while(1){

		/*
		if(counterStateLED >= 250){
			handlerStateLED.pGPIOx -> ODR ^= GPIO_ODR_OD5;		// Encendido y apagado StateLED
			counterStateLED = 0;
		}*/
		if(counterMPU6050 >= 10){
			// Activamos la lectura del MPU y del ADC cada 150 ms
			MPU6050IsReady = true;
			counterMPU6050 = 0;
			startSingleADC();									// Lanzamos la conversión ADC
		}

		if(MPU6050IsReady == true){
			// Leemos las aceleraciones del MPU6050 en x,y, y z.
			int16_t AccelX = MPU6050_SensorValue(&handler_MPU6050,ACCEL_X);
			int16_t AccelY = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Y);
			int16_t AccelZ = MPU6050_SensorValue(&handler_MPU6050,ACCEL_Z);

//			double fAccelX = ((AccelX*85)/17000)+145;
//			double fAccelY = ((AccelY*85)/17000)+145;
//			double fAccelZ = AccelZ*(9.81/16384.0);

			// Leemos los valores del giroscopio del MPU6050 en x,y, y z.
			int16_t GirosX = MPU6050_SensorValue(&handler_MPU6050,GYRO_X);
			int16_t GirosY = MPU6050_SensorValue(&handler_MPU6050,GYRO_Y);
//			int16_t GirosZ = MPU6050_SensorValue(&handler_MPU6050,GYRO_Z);

			double fGirosX = GirosX*(250.0/32768.0);		// Convertimos los datos de ADC a grados/s
			double fGirosY = GirosY*(250.0/32768.0);		// Convertimos los datos de ADC a grados/s
//			double fGirosZ = GirosZ*(250.0/32768.0);

			dt = (counterMillis - timePrev)/1000.0;			// Calculamos el dt
			timePrev = counterMillis;						// Actualizamos el to

