jutoroa/STM32F411RE/roboticArm_V2/Src/roboticArmV2.c
			//Calculamos los ángulos con el acelerometro
			double accel_ang_x = atan(AccelY/sqrt(pow(AccelX,2) + pow(AccelZ,2)))*(180.0/3.14159);
			double accel_ang_y = atan(-AccelX/sqrt(pow(AccelY,2) + pow(AccelZ,2)))*(180.0/3.14159);

			//Calculamos el angulo de rotación con giroscopio y filtro complemento
			ang_x = 0.98*(ang_x_prev+(fGirosX)*dt) + 0.02*accel_ang_x;
			ang_y = 0.98*(ang_y_prev+(fGirosY)*dt) + 0.02*accel_ang_y;

			ang_x_prev = ang_x;
			ang_y_prev = ang_y;

			duty_x = ((ang_x + 80.0) * (100.0/160.0)) + 80.0;
			duty_y = ((ang_y + 80.0) * (100.0/160.0)) + 80.0;

			// Cálculamos los ángulos con el factor de escala
//			girosc_ang_x = ((fGirosX)*dt)/1000.0 + girosc_ang_x_prev;      // Cálculamos los ángulos con el factor de escala
//			girosc_ang_y = ((fGirosY)*dt)/1000.0 + girosc_ang_y_prev;

			// Actualizamos para el siguiente ángulo
//			girosc_ang_x_prev = girosc_ang_x;
//			girosc_ang_y_prev = girosc_ang_y;

//			char bufferDataOLEDx[128] = {0};
//			sprintf(bufferDataOLEDx, "%f \n", duty_x);
//			writeMsg(&handlerCommTerminal, bufferDataOLEDx);

			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " ANGX: %f ", duty_x);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_1);
			sprintf(bufferDataOLEDx, " ANGY: %f ", duty_y);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_3);

			setDutty(&handlerPWMServo1, duty_x);
			setDutty(&handlerPWMServo2, duty_y);

			// Bajamos la bandera del MPU6050
			MPU6050IsReady	= false;

		}



		if(adcIsComplete == true){
			// Calculamos la escala para convertir la conversión ADC en movimiento del servo
			double fAdcData = (((adcData - 2100.0)*100.0)/1500.0) + 80.0;
			setDutty(&handlerPWMServo3, fAdcData);

			// Bajamos la bandera del ADC
			adcIsComplete = false;

			char bufferDataOLEDx[128] = {0};
			sprintf(bufferDataOLEDx, " ADC: %f ", fAdcData);
			OLED_FPrintPage(&handler_OLED, bufferDataOLEDx, PAGE_5);


//			char bufferDataOLEDx[128] = {0};
//			sprintf(bufferDataOLEDx, "%d \n", adcData);
//			writeMsg(&handlerCommTerminal, bufferDataOLEDx);
		}

		if(dataValue != '\0'){
			writeChar(&handlerCommTerminal,dataValue);
			// Comparación de los valores recibidos.
			if(dataValue == '1'){
				nMotor = 1;				// Acción cada vez que se oprima el interruptor
				auxLedState = 1;
			}else if(dataValue == '2'){
				nMotor = 2;				// Acción cada vez que se oprima el interruptor
				auxLedState = 2;
			}else if(dataValue == '3'){
				nMotor = 3;				// Acción cada vez que se oprima el interruptor
				auxLedState = 3;
			}
			ledControl();
			motorConfig();
			dataValue = '\0';
		}
	}
}

//***********// *********** // Definición de Funciones // *********** //***********//

//***********// Delay //***********//

void delay(int time){
	counterDelay = 0;
	while(counterDelay <= time){
		__NOP();
	}
	counterDelay = 0;
}

//***********// InitSystem //***********//

void initSystem(void){

	// Configuración el State LED
	handlerStateLED.pGPIOx								= GPIOA;
	handlerStateLED.GPIO_PinConfig.GPIO_PinNumber		= PIN_5;
	handlerStateLED.GPIO_PinConfig.GPIO_PinMode			= GPIO_MODE_OUT;
	handlerStateLED.GPIO_PinConfig.GPIO_PinOPType		= GPIO_OTYPE_PUSHPULL;
	handlerStateLED.GPIO_PinConfig.GPIO_PinPuPdControl	= GPIO_PUPDR_NOTHING;
	handlerStateLED.GPIO_PinConfig.GPIO_PinSpeed		= GPIO_OSPEED_HIGH;

	GPIO_Config(&handlerStateLED);

	// Definimos el handler para la configuración del STEP del motor1

	handlerStep1Config.pGPIOx 									= GPIOA;					// Puerto a emplear: GPIOC
	handlerStep1Config.GPIO_PinConfig.GPIO_PinNumber			= PIN_6;					// Pin a emplear: PC9
	handlerStep1Config.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_OUT;			// Señal de salida
	handlerStep1Config.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerStep1Config.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_PULLUP;
	handlerStep1Config.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerStep1Config.GPIO_PinConfig.GPIO_PinAltFunMode		= AF0;						// Ninguna función

	// Cargamos la configuración del PIN_B9 (Step1)
	GPIO_Config(&handlerStep1Config);

	// Definimos el handler para la dirección (DIR) del motor1

	handlerDir1Config.pGPIOx 									= GPIOA;					// Puerto a emplear: GPIOC
	handlerDir1Config.GPIO_PinConfig.GPIO_PinNumber				= PIN_11;					// Pin a emplear: PC8
	handlerDir1Config.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_OUT;			// Señal de salida
	handlerDir1Config.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	handlerDir1Config.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_PULLUP;
	handlerDir1Config.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerDir1Config.GPIO_PinConfig.GPIO_PinAltFunMode			= AF0;						// Ninguna función

	// Cargamos la configuración del PIN_B8  (DIR1)
	GPIO_Config(&handlerDir1Config);

	// Definimos el handler para la configuración del STEP del motor2

	handlerStep2Config.pGPIOx 									= GPIOA;					// Puerto a emplear: GPIOB
	handlerStep2Config.GPIO_PinConfig.GPIO_PinNumber			= PIN_7;					// Pin a emplear: PB9
	handlerStep2Config.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_OUT;			// Señal de salida
	handlerStep2Config.GPIO_PinConfig.GPIO_PinOPType			= GPIO_OTYPE_PUSHPULL;
	handlerStep2Config.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_PULLUP;
	handlerStep2Config.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerStep2Config.GPIO_PinConfig.GPIO_PinAltFunMode		= AF0;						// Ninguna función

	// Cargamos la configuración del PIN_A6 (Step2)
	GPIO_Config(&handlerStep2Config);

	// Definimos el handler para la dirección del motor2

	handlerDir2Config.pGPIOx 									= GPIOB;
	handlerDir2Config.GPIO_PinConfig.GPIO_PinNumber				= PIN_12;
	handlerDir2Config.GPIO_PinConfig.GPIO_PinMode				= GPIO_MODE_OUT;
	handlerDir2Config.GPIO_PinConfig.GPIO_PinOPType				= GPIO_OTYPE_PUSHPULL;
	handlerDir2Config.GPIO_PinConfig.GPIO_PinPuPdControl		= GPIO_PUPDR_PULLUP;
	handlerDir2Config.GPIO_PinConfig.GPIO_PinSpeed				= GPIO_OSPEED_HIGH;
	handlerDir2Config.GPIO_PinConfig.GPIO_PinAltFunMode			= AF0;

	// Cargamos la configuración del PIN_A5  (DIR2)
	GPIO_Config(&handlerDir2Config);

